lib/jacamo-0.5/doc/faq.org
#+TITLE:     Frequently Asked Questions on the use of the JaCaMo Platform
#+AUTHOR:    JaCaMo Team
#+EMAIL:     
#+DATE:      September 2015

#+SUBTITLE:  Frequently Asked Questions \\ on the use of \\ the JaCaMo Platform
#+DESCRIPTION: 
#+KEYWORDS: 
#+LANGUAGE:  en
#+OPTIONS: email:t H:3 toc:4 num:t \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS: TeX:t LaTeX:nil skip:nil d:nil todo:t pri:nil tags:nil
#+OPTIONS: org-html-html5-fancy:t
#+INFOJS_OPT: view:nil toc:nil ltoc:t mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
# +LINK_UP: index.html 
# +LINK_HOME: index.html
#+STYLE: <link rel="stylesheet" type="text/css" href="./jcm.css" />

* How to program agents?
*ToBeCompleted*
* How can agents use the environment?
** What is an Artifact?
*ToBeCompleted*
*** observeProperty 
#+BEGIN_EXAMPLE
 observeProperty(String name, OpFeedbackParam<ArtifactObsProperty> prop)
#+END_EXAMPLE
** What are the default artifacts at the disposal of agents?
By default, each workspace contains a basic set of predefined artifacts that provide core functionalities to the agents.
+ *workspace* artifact /cartago.WorkspaceArtifact/ (see the [[http://jacamo.sf.net/doc/cartago/main-api/cartago/WorkspaceArtifact.html][Workspace API]]): the workspace artifact provides functionalities to create, dispose, lookup, link, focus artifacts of the workspace. It provides also operations to set roles and policies related to the RBAC security model.
+ *node* artifact /cartago.NodeArtifact/ (see the [[http://jacamo.sf.net/doc/cartago/main-api/cartago/NodeArtifact.html][Node API]]) provides functionalities to create new workspaces, to join local and remote workspaces
+ *blackboard* artifact /cartago.tools.TupleSpace/ provides a tuple space that agents can exploit to communicate and coordinate with each other.
+ *console* artifact /cartago.tools.Console/ provides functionalities to print messages on standard output.
** How can an agent use and access the Manual of an Artifact?
An agent can use and access the Manual of an Artifact through the *ManRepoArtifact* Artifact.
*** How to store the Manual?
An agent can use the operation *storeManual* of the *ManRepoArtifact* as follows:
#+BEGIN_EXAMPLE
  storeManual(String artifactModelName, String uri)
#+END_EXAMPLE
*** How to get the Manual of an artifact of a certain type?
An agent can use the operation *getManualContent* of the *ManRepoArtifact* as follows:
#+BEGIN_EXAMPLE
  getManualContent(String artifactModelName, OpFeedbackParam<String> content)
#+END_EXAMPLE
*** How to consult the Manual of an artifact of a certain type?
An agent can use the operation *consultManual* of the *ManRepoArtifact* as follows:
#+BEGIN_EXAMPLE
  consultManual(String artifactModelName)
#+END_EXAMPLE
** How can agent use and operate on a Node?
*** How to get the Id of a node?
An agent can get the Id of a node by using the operation *getNodeId* of the /NodeArtifact/ where /param/ is the parameter receiving the Node Id.
#+BEGIN_EXAMPLE
  getNodeId(OpFeedbackParam<NodeId> param)
#+END_EXAMPLE
*** How to enable Linking with Node?
An agent can enable linking with node by using the operation *enableLinkingWithNode* of the /NodeArtifact/ where /id/ is the Node Id, /support/ is the kind of support and /address/ is the address of the node to link with. 
#+BEGIN_EXAMPLE
  enableLinkingWithNode(NodeId id, String support, String address)
#+END_EXAMPLE
*** How to shutdown a Node?
**** in a graceful way
An agent can shutdown a node by using the operation *shutdownNode* of the /NodeArtifact/ calling the dispose routines of all the artifacts. 
#+BEGIN_EXAMPLE
  shutdownNode()
#+END_EXAMPLE
**** and after one second shutdown the VM
by using the operation *crash* of the /NodeArtifact/
#+BEGIN_EXAMPLE
  crash()
#+END_EXAMPLE
** How can an agent get information on the workspaces in a Node?
An agent can use and access the workspaces through the *NodeArtifact*
*** Working in workspaces
+ By default an agent, when launched, joins the default workspace on current node. 
+ Agents can create, join and work in multiple workspace at a time. However there is always a current workspace, to which are routed actions with no artifact id or workspace id specified. 
# Current workspace info are automatically tracked by the current *wsp(WspId,Name,NodeId)* belief.
+ Agents can join workspaces that are hosted on remote nodes, by means of a *joinRemoteWorkspace* action. As soon as the join succeed, the interaction within remote workspaces is the same as local workspace.
