lib/jacamo-0.5/doc/faq.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Frequently Asked Questions on the use of the JaCaMo Platform</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="Frequently Asked Questions on the use of the JaCaMo Platform"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="September 2015"/>
<meta name="author" content="JaCaMo Team"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" type="text/css" href="./jcm.css" />

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Frequently Asked Questions on the use of the JaCaMo Platform</h1>



<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 How to program agents?</a></li>
<li><a href="#sec-2">2 How can agents use the environment?</a>
<ul>
<li><a href="#sec-2-1">2.1 What is an Artifact?</a>
<ul>
<li><a href="#sec-2-1-1">2.1.1 observeProperty</a></li>
</ul>
</li>
<li><a href="#sec-2-2">2.2 What are the default artifacts at the disposal of agents?</a></li>
<li><a href="#sec-2-3">2.3 How can an agent use and access the Manual of an Artifact?</a>
<ul>
<li><a href="#sec-2-3-1">2.3.1 How to store the Manual?</a></li>
<li><a href="#sec-2-3-2">2.3.2 How to get the Manual of an artifact of a certain type?</a></li>
<li><a href="#sec-2-3-3">2.3.3 How to consult the Manual of an artifact of a certain type?</a></li>
</ul>
</li>
<li><a href="#sec-2-4">2.4 How can agent use and operate on a Node?</a>
<ul>
<li><a href="#sec-2-4-1">2.4.1 How to get the Id of a node?</a></li>
<li><a href="#sec-2-4-2">2.4.2 How to enable Linking with Node?</a></li>
<li><a href="#sec-2-4-3">2.4.3 How to shutdown a Node?</a></li>
</ul>
</li>
<li><a href="#sec-2-5">2.5 How can an agent get information on the workspaces in a Node?</a>
<ul>
<li><a href="#sec-2-5-1">2.5.1 Working in workspaces</a></li>
<li><a href="#sec-2-5-2">2.5.2 How to get the workspaces of a Node?</a></li>
<li><a href="#sec-2-5-3">2.5.3 How to join a workspace?</a></li>
<li><a href="#sec-2-5-4">2.5.4 How to quit workspace?</a></li>
<li><a href="#sec-2-5-5">2.5.5 How to create a workspace ?</a></li>
</ul>
</li>
<li><a href="#sec-2-6">2.6 How can an agent use and access artifacts within a Workspace?</a>
<ul>
<li><a href="#sec-2-6-1">2.6.1 How to make agents invoque operations of the artifact?</a></li>
<li><a href="#sec-2-6-2">2.6.2 How to create or delete Artifacts?</a></li>
<li><a href="#sec-2-6-3">2.6.3 How to get the artifacts within a workspace?</a></li>
<li><a href="#sec-2-6-4">2.6.4 How to observe artifacts?</a></li>
<li><a href="#sec-2-6-5">2.6.5 How to stop Observing artifacts?</a></li>
<li><a href="#sec-2-6-6">2.6.6 How to link artifacts?</a></li>
<li><a href="#sec-2-6-7">2.6.7 How to add a specific rule-based management to a workspace?</a></li>
<li><a href="#sec-2-6-8">2.6.8 How to add a specific topology to a workspace?</a></li>
<li><a href="#sec-2-6-9">2.6.9 How to add RBAC to a workspace?</a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-3">3 How can an agent use the organization?</a>
<ul>
<li><a href="#sec-3-1">3.1 How can an agent use Groups?</a>
<ul>
<li><a href="#sec-3-1-1">3.1.1 How to manage groups?</a></li>
<li><a href="#sec-3-1-2">3.1.2 How to enter a group?</a></li>
<li><a href="#sec-3-1-3">3.1.3 How to manage roles within a group?</a></li>
<li><a href="#sec-3-1-4">3.1.4 How to manage social scheme responsibilities of a group?</a></li>
<li><a href="#sec-3-1-5">3.1.5 How to manage hierachies of groups?</a></li>
<li><a href="#sec-3-1-6">3.1.6 How to manage ownership of a group?</a></li>
<li><a href="#sec-3-1-7">3.1.7 How to get the status of a group?</a></li>
</ul>
</li>
<li><a href="#sec-3-2">3.2 How can an agent use social schemes?</a>
<ul>
<li><a href="#sec-3-2-1">3.2.1 How to manage a social scheme?</a></li>
<li><a href="#sec-3-2-2">3.2.2 How to manage goals?</a></li>
<li><a href="#sec-3-2-3">3.2.3 How to manage missions?</a></li>
</ul>
</li>
<li><a href="#sec-3-3">3.3 How can an agent manage norms and obligations?</a>
<ul>
<li><a href="#sec-3-3-1">3.3.1 How to get the current obligations?</a></li>
<li><a href="#sec-3-3-2">3.3.2 How to get the status of a norm?</a></li>
<li><a href="#sec-3-3-3">3.3.3 How to get the reason why a norm has failed?</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> How to program agents?</h2>
<div class="outline-text-2" id="text-1">

<p><b>ToBeCompleted</b>
</p></div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> How can agents use the environment?</h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> What is an Artifact?</h3>
<div class="outline-text-3" id="text-2-1">

<p><b>ToBeCompleted</b>
</p>
</div>

<div id="outline-container-2-1-1" class="outline-4">
<h4 id="sec-2-1-1"><span class="section-number-4">2.1.1</span> observeProperty</h4>
<div class="outline-text-4" id="text-2-1-1">




<pre class="example">observeProperty(String name, OpFeedbackParam&lt;ArtifactObsProperty&gt; prop)
</pre>

</div>
</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> What are the default artifacts at the disposal of agents?</h3>
<div class="outline-text-3" id="text-2-2">

<p>By default, each workspace contains a basic set of predefined artifacts that provide core functionalities to the agents.
</p><ul>
<li><b>workspace</b> artifact <i>cartago.WorkspaceArtifact</i> (see the <a href="http://jacamo.sf.net/doc/cartago/main-api/cartago/WorkspaceArtifact.html">Workspace API</a>): the workspace artifact provides functionalities to create, dispose, lookup, link, focus artifacts of the workspace. It provides also operations to set roles and policies related to the RBAC security model.
</li>
<li><b>node</b> artifact <i>cartago.NodeArtifact</i> (see the <a href="http://jacamo.sf.net/doc/cartago/main-api/cartago/NodeArtifact.html">Node API</a>) provides functionalities to create new workspaces, to join local and remote workspaces
</li>
<li><b>blackboard</b> artifact <i>cartago.tools.TupleSpace</i> provides a tuple space that agents can exploit to communicate and coordinate with each other.
</li>
<li><b>console</b> artifact <i>cartago.tools.Console</i> provides functionalities to print messages on standard output.
</li>
</ul>

</div>

</div>

<div id="outline-container-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> How can an agent use and access the Manual of an Artifact?</h3>
<div class="outline-text-3" id="text-2-3">

<p>An agent can use and access the Manual of an Artifact through the <b>ManRepoArtifact</b> Artifact.
</p>
</div>

<div id="outline-container-2-3-1" class="outline-4">
<h4 id="sec-2-3-1"><span class="section-number-4">2.3.1</span> How to store the Manual?</h4>
<div class="outline-text-4" id="text-2-3-1">

<p>An agent can use the operation <b>storeManual</b> of the <b>ManRepoArtifact</b> as follows:
</p>


<pre class="example">storeManual(String artifactModelName, String uri)
</pre>

</div>

</div>

<div id="outline-container-2-3-2" class="outline-4">
<h4 id="sec-2-3-2"><span class="section-number-4">2.3.2</span> How to get the Manual of an artifact of a certain type?</h4>
<div class="outline-text-4" id="text-2-3-2">

<p>An agent can use the operation <b>getManualContent</b> of the <b>ManRepoArtifact</b> as follows:
</p>


<pre class="example">getManualContent(String artifactModelName, OpFeedbackParam&lt;String&gt; content)
</pre>

</div>

</div>

<div id="outline-container-2-3-3" class="outline-4">
<h4 id="sec-2-3-3"><span class="section-number-4">2.3.3</span> How to consult the Manual of an artifact of a certain type?</h4>
<div class="outline-text-4" id="text-2-3-3">

<p>An agent can use the operation <b>consultManual</b> of the <b>ManRepoArtifact</b> as follows:
</p>


<pre class="example">consultManual(String artifactModelName)
</pre>

</div>
</div>

</div>

<div id="outline-container-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> How can agent use and operate on a Node?</h3>
<div class="outline-text-3" id="text-2-4">


</div>

<div id="outline-container-2-4-1" class="outline-4">
<h4 id="sec-2-4-1"><span class="section-number-4">2.4.1</span> How to get the Id of a node?</h4>
<div class="outline-text-4" id="text-2-4-1">

<p>An agent can get the Id of a node by using the operation <b>getNodeId</b> of the <i>NodeArtifact</i> where <i>param</i> is the parameter receiving the Node Id.
</p>


<pre class="example">getNodeId(OpFeedbackParam&lt;NodeId&gt; param)
</pre>

</div>

</div>

<div id="outline-container-2-4-2" class="outline-4">
<h4 id="sec-2-4-2"><span class="section-number-4">2.4.2</span> How to enable Linking with Node?</h4>
<div class="outline-text-4" id="text-2-4-2">

<p>An agent can enable linking with node by using the operation <b>enableLinkingWithNode</b> of the <i>NodeArtifact</i> where <i>id</i> is the Node Id, <i>support</i> is the kind of support and <i>address</i> is the address of the node to link with. 
</p>


<pre class="example">enableLinkingWithNode(NodeId id, String support, String address)
</pre>

</div>

</div>

<div id="outline-container-2-4-3" class="outline-4">
<h4 id="sec-2-4-3"><span class="section-number-4">2.4.3</span> How to shutdown a Node?</h4>
<div class="outline-text-4" id="text-2-4-3">

<ul>
<li id="sec-2-4-3-1">in a graceful way<br/>
An agent can shutdown a node by using the operation <b>shutdownNode</b> of the <i>NodeArtifact</i> calling the dispose routines of all the artifacts. 



<pre class="example">shutdownNode()
</pre>

</li>
</ul>
<ul>
<li id="sec-2-4-3-2">and after one second shutdown the VM<br/>
by using the operation <b>crash</b> of the <i>NodeArtifact</i>



<pre class="example">crash()
</pre>

</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> How can an agent get information on the workspaces in a Node?</h3>
<div class="outline-text-3" id="text-2-5">

<p>An agent can use and access the workspaces through the <b>NodeArtifact</b>
</p>
</div>

<div id="outline-container-2-5-1" class="outline-4">
<h4 id="sec-2-5-1"><span class="section-number-4">2.5.1</span> Working in workspaces</h4>
<div class="outline-text-4" id="text-2-5-1">

<ul>
<li>By default an agent, when launched, joins the default workspace on current node. 
</li>
<li>Agents can create, join and work in multiple workspace at a time. However there is always a current workspace, to which are routed actions with no artifact id or workspace id specified. 
</li>
</ul>

<ul>
<li>Agents can join workspaces that are hosted on remote nodes, by means of a <b>joinRemoteWorkspace</b> action. As soon as the join succeed, the interaction within remote workspaces is the same as local workspace.
</li>
</ul>

</div>

</div>
