lib/jacamo-0.5/doc/faq.org
*** How to get the workspaces of a Node?
**** By focusing on the Node Artifact
By focusing on the /NodeArtifact/, getting the observable property *workspace(name, wspId)*
**** By discovering a workspace by name
By using the operation *lookupWorkspace* on the /NodeArtifact/ where /workspaceName/ is the name of the workspace and /aid/ is the output parameter receiving the workspace id
#+BEGIN_EXAMPLE
  lookupWorkspace(String wspName, OpFeedbackParam<ArtifactId> aid)
#+END_EXAMPLE
*** How to join a workspace?
**** a local one
by using the operation *joinWorkspace*  of the /NodeArtifact/ where /wspName/ is the workspace name and /res/ is the output parameter receiving the workspace id
#+BEGIN_EXAMPLE
joinWorkspace(String wspName, OpFeedbackParam<WorkspaceId> res)
#+END_EXAMPLE
**** a local one, giving credentials
by using the operation *joinWorkspace* of the /NodeArtifact/ where /wspName/ is the workspace name, /cred/ are the agent credentials, /res/ is the output parameter receiving the workspace id.
#+BEGIN_EXAMPLE
  joinWorkspace(String wspName, AgentCredential cred, OpFeedbackParam<WorkspaceId> res)
#+END_EXAMPLE
**** a remote one
by using the operation *joinRemoteWorkspace*  of the /NodeArtifact/ where /wspName/ is the workspace name, /address/ is the address and /res/ is the output parameter receiving the workspace id.
#+BEGIN_EXAMPLE
joinRemoteWorkspace(String wspName, String address, OpFeedbackParam<WorkspaceId> res)
#+END_EXAMPLE
**** a remote one with infraServiceType
by using the operation *joinRemoteWorkspace* of the /NodeArtifact/ where /wspName/ is the workspace name, /address/ is the address, /infraServiceType/ is the infrastructure service type (use /"default"/ to use default one), and /res/ is the output parameter receiving the workspace id.
#+BEGIN_EXAMPLE
joinRemoteWorkspace(String wspName, String address, String infraServiceType, OpFeedbackParam<WorkspaceId> res) 
#+END_EXAMPLE
*Infrastructure options*: 
  + by default, Jason programs using CArtAgO environment create a standalone CArtAgO node, i.e. not accessible through the network
  + To install a CArtAgO node accessible also to remote agents further parameters can be specified to the c4jason.CartagoEnvironment:
     + *c4jason.CartagoEnvironment("infrastructure"{,WspName, protocol(ProtName, Address), ...})*: installs an infrastructure layer specifying the protocols to support and the local address where to start the service;
     + *c4jason.CartagoEnvironment("remote"{,WspName, protocol(ProtName, Address), ...})*: does not install any node – agents directly join the specified remote workspace;
     + *c4jason.CartagoEnvironment("local"{,WspName})*: does not install any node – agents directly join the specified local workspace.
*** How to quit workspace?
An agent can qui a workspace by using the operation *quitWorkspace* of the /WorkspaceArtifact/ that it wants to quit
#+BEGIN_EXAMPLE
  quitWorkspace(WorkspaceArtifact WspId)
#+END_EXAMPLE
*** How to create a workspace ?
**** in the local node.
An agent can create a workspace in the local node by using the operation *createWorkspace(String name)* of the /NodeArtifact/ where /name/ is the name of the workspace
**** in the local node, with a topology
An agent can create a workspace in the local node by using the operation *createWorkspaceWithTopology(String name, String topologyClassName)* of the /NodeArtifact/ where /name/ is the name of the workspace and /topologyClassName/ is the topology
**** in the local one with a logger
An agent can create a workspace in the local node by using the operation *createWorkspace(String wspName, ICartagoLogger logger)* of the /NodeArtifact/ where /wspName/ is the workspace name and /logger/ of type /ICartagoLogger/ is the logger
** How can an agent use and access artifacts within a Workspace?
An agent can use and access artifacts within a workspace through the *WorkspaceArtifact*
*** How to make agents invoque operations of the artifact?
+ In case of operation invocation with no specification of target artifact: the artifact is automatically selected from the workspace. If there are no artifacts providing such action, the action fails. if more than one artifact is found, artifacts created by the agent itself are considered first. If more than one artifact is found, one is selected non deterministically. Then, the rest of the artifacts are considered, and one is selected non deterministically.
+ In case of operation invocation with specification of a target artifact: This is done by adding the annotation *~[artifact_id(Id)]~*, where /Id/ must be bound to the artifact identifier. Alternatively, the annotation *~[artifact_name(Name)]~* can be used, where /Name/ must be bound to the logic name of the artifact.
+ In case of operation invocation with specification of the target workspace: done by adding the annotation *~[wsp_id(WspID)]~*, where /WspID/ must be bound to the wsp identifier.
*** How to create or delete Artifacts?
**** Create a new artifact
by using the operation *makeArtifact* of the /WorkspaceArtifact/ where /name/ is the name of the artifact, /template/ is the artifact template (type) and /aid/ is the output parameter receiving the artifact id.
#+BEGIN_EXAMPLE
  makeArtifact(String artifactName, String templateName, OpFeedbackParam<ArtifactId> aid)
#+END_EXAMPLE
**** Create a new artifact with configuration
by using the operation *makeArtifact* of the /WorkspaceArtifact/ where /name/ is the name of the artifact, /template/ is the artifact template (type), /artifactconf/ the artifact configuration and /aid/ is the output parameter receiving the artifact id.
#+BEGIN_EXAMPLE
makeArtifact(String artifactName, String templateName, ArtifactConfig artifactconf, OpFeedbackParam<ArtifactId>   aid)
#+END_EXAMPLE
**** Add an artifact factory
by using the operation *addArtifactFactory* of the /WorkspaceArtifact/ where /factory/ is the artifact factory.
#+BEGIN_EXAMPLE
  addArtifactFactory(ArtifactFactory factory)
#+END_EXAMPLE
**** Remove an existing artifact factory
by using the operation *removeArtifactFactory* of the /WorkspaceArtifact/ where /name/ is the factory name
#+BEGIN_EXAMPLE
  removeArtifactFactory(String name)
#+END_EXAMPLE
**** Dispose Artifact
by using the operation *disposeArtifact* of the /WorkspaceArtifact/ where /id/ is the artifact id. 
#+BEGIN_EXAMPLE
  disposeArtifact(ArtifactId id)
#+END_EXAMPLE
*** How to get the artifacts within a workspace?
**** By focusing on the Workspace Artifact
By focusing on the Workspace Artifact, getting the observable property /artifact(artifactName, templateName, id)/
