lib/jacamo-0.5/doc/faq.html

<div id="outline-container-2-5-2" class="outline-4">
<h4 id="sec-2-5-2"><span class="section-number-4">2.5.2</span> How to get the workspaces of a Node?</h4>
<div class="outline-text-4" id="text-2-5-2">

<ul>
<li id="sec-2-5-2-1">By focusing on the Node Artifact<br/>
By focusing on the <i>NodeArtifact</i>, getting the observable property <b>workspace(name, wspId)</b>
</li>
</ul>
<ul>
<li id="sec-2-5-2-2">By discovering a workspace by name<br/>
By using the operation <b>lookupWorkspace</b> on the <i>NodeArtifact</i> where <i>workspaceName</i> is the name of the workspace and <i>aid</i> is the output parameter receiving the workspace id



<pre class="example">lookupWorkspace(String wspName, OpFeedbackParam&lt;ArtifactId&gt; aid)
</pre>

</li>
</ul>
</div>

</div>

<div id="outline-container-2-5-3" class="outline-4">
<h4 id="sec-2-5-3"><span class="section-number-4">2.5.3</span> How to join a workspace?</h4>
<div class="outline-text-4" id="text-2-5-3">

<ul>
<li id="sec-2-5-3-1">a local one<br/>
by using the operation <b>joinWorkspace</b>  of the <i>NodeArtifact</i> where <i>wspName</i> is the workspace name and <i>res</i> is the output parameter receiving the workspace id



<pre class="example">joinWorkspace(String wspName, OpFeedbackParam&lt;WorkspaceId&gt; res)
</pre>

</li>
</ul>
<ul>
<li id="sec-2-5-3-2">a local one, giving credentials<br/>
by using the operation <b>joinWorkspace</b> of the <i>NodeArtifact</i> where <i>wspName</i> is the workspace name, <i>cred</i> are the agent credentials, <i>res</i> is the output parameter receiving the workspace id.



<pre class="example">joinWorkspace(String wspName, AgentCredential cred, OpFeedbackParam&lt;WorkspaceId&gt; res)
</pre>

</li>
</ul>
<ul>
<li id="sec-2-5-3-3">a remote one<br/>
by using the operation <b>joinRemoteWorkspace</b>  of the <i>NodeArtifact</i> where <i>wspName</i> is the workspace name, <i>address</i> is the address and <i>res</i> is the output parameter receiving the workspace id.



<pre class="example">joinRemoteWorkspace(String wspName, String address, OpFeedbackParam&lt;WorkspaceId&gt; res)
</pre>

</li>
</ul>
<ul>
<li id="sec-2-5-3-4">a remote one with infraServiceType<br/>
by using the operation <b>joinRemoteWorkspace</b> of the <i>NodeArtifact</i> where <i>wspName</i> is the workspace name, <i>address</i> is the address, <i>infraServiceType</i> is the infrastructure service type (use /"default"/ to use default one), and <i>res</i> is the output parameter receiving the workspace id.



<pre class="example">joinRemoteWorkspace(String wspName, String address, String infraServiceType, OpFeedbackParam&lt;WorkspaceId&gt; res) 
</pre>

<p>
<b>Infrastructure options</b>: 
</p><ul>
<li>by default, Jason programs using CArtAgO environment create a standalone CArtAgO node, i.e. not accessible through the network
</li>
<li>To install a CArtAgO node accessible also to remote agents further parameters can be specified to the c4jason.CartagoEnvironment:
<ul>
<li><b>c4jason.CartagoEnvironment("infrastructure"{,WspName, protocol(ProtName, Address), &hellip;})</b>: installs an infrastructure layer specifying the protocols to support and the local address where to start the service;
</li>
<li><b>c4jason.CartagoEnvironment("remote"{,WspName, protocol(ProtName, Address), &hellip;})</b>: does not install any node – agents directly join the specified remote workspace;
</li>
<li><b>c4jason.CartagoEnvironment("local"{,WspName})</b>: does not install any node – agents directly join the specified local workspace.
</li>
</ul>

</li>
</ul>

</li>
</ul>
</div>

</div>

<div id="outline-container-2-5-4" class="outline-4">
<h4 id="sec-2-5-4"><span class="section-number-4">2.5.4</span> How to quit workspace?</h4>
<div class="outline-text-4" id="text-2-5-4">

<p>An agent can qui a workspace by using the operation <b>quitWorkspace</b> of the <i>WorkspaceArtifact</i> that it wants to quit
</p>


<pre class="example">quitWorkspace(WorkspaceArtifact WspId)
</pre>

</div>

</div>

<div id="outline-container-2-5-5" class="outline-4">
<h4 id="sec-2-5-5"><span class="section-number-4">2.5.5</span> How to create a workspace ?</h4>
<div class="outline-text-4" id="text-2-5-5">

<ul>
<li id="sec-2-5-5-1">in the local node.<br/>
An agent can create a workspace in the local node by using the operation <b>createWorkspace(String name)</b> of the <i>NodeArtifact</i> where <i>name</i> is the name of the workspace
</li>
</ul>
<ul>
<li id="sec-2-5-5-2">in the local node, with a topology<br/>
An agent can create a workspace in the local node by using the operation <b>createWorkspaceWithTopology(String name, String topologyClassName)</b> of the <i>NodeArtifact</i> where <i>name</i> is the name of the workspace and <i>topologyClassName</i> is the topology
</li>
</ul>
<ul>
<li id="sec-2-5-5-3">in the local one with a logger<br/>
An agent can create a workspace in the local node by using the operation <b>createWorkspace(String wspName, ICartagoLogger logger)</b> of the <i>NodeArtifact</i> where <i>wspName</i> is the workspace name and <i>logger</i> of type <i>ICartagoLogger</i> is the logger
</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-2-6" class="outline-3">
<h3 id="sec-2-6"><span class="section-number-3">2.6</span> How can an agent use and access artifacts within a Workspace?</h3>
<div class="outline-text-3" id="text-2-6">

<p>An agent can use and access artifacts within a workspace through the <b>WorkspaceArtifact</b>
</p>
</div>

<div id="outline-container-2-6-1" class="outline-4">
<h4 id="sec-2-6-1"><span class="section-number-4">2.6.1</span> How to make agents invoque operations of the artifact?</h4>
<div class="outline-text-4" id="text-2-6-1">

<ul>
<li>In case of operation invocation with no specification of target artifact: the artifact is automatically selected from the workspace. If there are no artifacts providing such action, the action fails. if more than one artifact is found, artifacts created by the agent itself are considered first. If more than one artifact is found, one is selected non deterministically. Then, the rest of the artifacts are considered, and one is selected non deterministically.
</li>
<li>In case of operation invocation with specification of a target artifact: This is done by adding the annotation <b>~[artifact<sub>id</sub>(Id)]~</b>, where <i>Id</i> must be bound to the artifact identifier. Alternatively, the annotation <b>~[artifact<sub>name</sub>(Name)]~</b> can be used, where <i>Name</i> must be bound to the logic name of the artifact.
</li>
<li>In case of operation invocation with specification of the target workspace: done by adding the annotation <b>~[wsp<sub>id</sub>(WspID)]~</b>, where <i>WspID</i> must be bound to the wsp identifier.
</li>
</ul>

</div>

</div>

<div id="outline-container-2-6-2" class="outline-4">
<h4 id="sec-2-6-2"><span class="section-number-4">2.6.2</span> How to create or delete Artifacts?</h4>
<div class="outline-text-4" id="text-2-6-2">

<ul>
<li id="sec-2-6-2-1">Create a new artifact<br/>
by using the operation <b>makeArtifact</b> of the <i>WorkspaceArtifact</i> where <i>name</i> is the name of the artifact, <i>template</i> is the artifact template (type) and <i>aid</i> is the output parameter receiving the artifact id.



<pre class="example">makeArtifact(String artifactName, String templateName, OpFeedbackParam&lt;ArtifactId&gt; aid)
</pre>

</li>
</ul>
<ul>
<li id="sec-2-6-2-2">Create a new artifact with configuration<br/>
by using the operation <b>makeArtifact</b> of the <i>WorkspaceArtifact</i> where <i>name</i> is the name of the artifact, <i>template</i> is the artifact template (type), <i>artifactconf</i> the artifact configuration and <i>aid</i> is the output parameter receiving the artifact id.



<pre class="example">makeArtifact(String artifactName, String templateName, ArtifactConfig artifactconf, OpFeedbackParam&lt;ArtifactId&gt;   aid)
</pre>

</li>
</ul>
<ul>
<li id="sec-2-6-2-3">Add an artifact factory<br/>
by using the operation <b>addArtifactFactory</b> of the <i>WorkspaceArtifact</i> where <i>factory</i> is the artifact factory.



<pre class="example">addArtifactFactory(ArtifactFactory factory)
</pre>

</li>
</ul>
<ul>
<li id="sec-2-6-2-4">Remove an existing artifact factory<br/>
by using the operation <b>removeArtifactFactory</b> of the <i>WorkspaceArtifact</i> where <i>name</i> is the factory name



<pre class="example">removeArtifactFactory(String name)
</pre>

</li>
</ul>
<ul>
<li id="sec-2-6-2-5">Dispose Artifact<br/>
by using the operation <b>disposeArtifact</b> of the <i>WorkspaceArtifact</i> where <i>id</i> is the artifact id. 



<pre class="example">disposeArtifact(ArtifactId id)
</pre>

</li>
</ul>
</div>

</div>

<div id="outline-container-2-6-3" class="outline-4">
<h4 id="sec-2-6-3"><span class="section-number-4">2.6.3</span> How to get the artifacts within a workspace?</h4>
<div class="outline-text-4" id="text-2-6-3">

<ul>
<li id="sec-2-6-3-1">By focusing on the Workspace Artifact<br/>
By focusing on the Workspace Artifact, getting the observable property <i>artifact(artifactName, templateName, id)</i>
</li>
</ul>
<ul>
