lib/jacamo-0.5/doc/faq.org
**** By discovering an artifact by name
Using the operation *lookupArtifact* of the /WorkspaceArtifact/ where /artifactName (string)/ is the name of the artifact, /aid/ is the output parameter receiving the id of the artifact.
#+BEGIN_EXAMPLE
  lookupArtifact(String artifactName, OpFeedbackParam<ArtifactId> aid)
#+END_EXAMPLE
**** By discovering an artifact by type
Using the operation *lookupArtifactByType* of the /WorkspaceArtifact/ where /artifactName (string)/ is the name of the artifact, /aid/ is the output parameter receiving the id of the artifact.
#+BEGIN_EXAMPLE
  lookupArtifactByType(String artifactType, OpFeedbackParam<ArtifactId> aid)
#+END_EXAMPLE
**** By getting the list of available artifact names
Using the operation *getCurrentArtifacts* of the /WorkspaceArtifact/ where /list/ is the output parameter receiving the list of the artifact names.
#+BEGIN_EXAMPLE
  getCurrentArtifacts(OpFeedbackParam<String[]> list)
#+END_EXAMPLE
**** By getting the current artifact list
Using the operation *getArtifactList* of the /WorkspaceArtifact/ where /artifacts/ is the output parameter receiving the list of the artifact ids.
#+BEGIN_EXAMPLE
  getArtifactList(OpFeedbackParam<ArtifactId[]> artifacts)
#+END_EXAMPLE
*** How to observe artifacts?
**** Start observing 
Using the operation *focus* of the /WorkspaceArtifact/ where /aid/ is the artifact id on which ones wants to focus.
#+BEGIN_EXAMPLE
  focus(ArtifactId aid)
#+END_EXAMPLE
**** Start observing when available
Using the operation *focusWhenAvailable* of the /WorkspaceArtifact/ where /artName/ is the artifact name
#+BEGIN_EXAMPLE
  focusWhenAvailable(String artName)
#+END_EXAMPLE
**** Start observing for specific events
Using the operation *focus* of the /WorkspaceArtifact/ where /aid/ is the artifact id, /filter/ is the filter to select which events to perceive
#+BEGIN_EXAMPLE
  focus(ArtifactId aid, IEventFilter filter)
#+END_EXAMPLE
**** Start observing for specific events when available
Using the operation *focusWhenAvailable* of the /WorkspaceArtifact/ where /artName/ is the artifact name, /filter/ is the filter to select the events to perceive
#+BEGIN_EXAMPLE
  focusWhenAvailable(String artName, IEventFilter filter)
#+END_EXAMPLE
*** How to stop Observing artifacts?
**** Stop observing an artifact
Using the operation *stopFocus* of the /WorkspaceArtifact/ where /aid/ is the artifact id that one wants to stop focusing on
#+BEGIN_EXAMPLE
  stopFocus(ArtifactId aid)
#+END_EXAMPLE
*** How to link artifacts?
Using the operation *linkArtifacts* of the /WorkspaceArtifact/ where /artifactOutId/ is the artifact id source of the link, /artifactOutPort/ is the port of the source, /artifactInId/ is the artifact id of the target of the link
#+BEGIN_EXAMPLE
  linkArtifacts(ArtifactId artifactOutId, String artifactOutPort, ArtifactId artifactInId)
#+END_EXAMPLE
*** How to add a specific rule-based management to a workspace?
Using the operation *setWSPRuleEngine* of the /WorkspaceArtifact/ where /man/ is the rule engine to add
#+BEGIN_EXAMPLE
  setWSPRuleEngine(AbstractWSPRuleEngine man)
#+END_EXAMPLE
*** How to add a specific topology to a workspace?
Using the operation *setWorkspaceTopology* of the /WorkspaceArtifact/
#+BEGIN_EXAMPLE
  setWorkspaceTopology(AbstractWorkspaceTopology topology)
#+END_EXAMPLE
*** COMMENT manuals management
**** create manual 
+ createManual(String src, OpFeedbackParam<ArtifactId> aid)
**** create manual from file
+ createManualFromFile(String fname, OpFeedbackParam<ArtifactId> aid) 
*** How to add RBAC to a workspace?
**** Setting a security manager
Using the operation *setSecurityManager* of the /WorkspaceArtifact/ where /man/ is the security manager
#+BEGIN_EXAMPLE
  setSecurityManager(IWorkspaceSecurityManager man)
#+END_EXAMPLE
**** Adding a role
Using the operation *addRole* of the /WorkspaceArtifact/ where /roleName/ is the role Name to add
#+BEGIN_EXAMPLE
  addRole(String roleName)
#+END_EXAMPLE
**** Removing a role, if it exists
Using the operation *removeRole* of the /WorkspaceArtifact/ where /roleName/ is the role Name to remove
#+BEGIN_EXAMPLE
  removeRole(String roleName)
#+END_EXAMPLE
**** Getting the current roles list
Using the operation *getRoleList* of the /WorkspaceArtifact/ where /list/ is the role list
#+BEGIN_EXAMPLE
  getRoleList(OpFeedbackParam<String[]> list)
#+END_EXAMPLE
**** Adding a policy to a role 
Using the operation *addRolePolicy* of the /WorkspaceArtifact/ where /roleName/ is the role name, /artifactName/ is the artifact name, /policy/ is the policy
#+BEGIN_EXAMPLE
  addRolePolicy(String roleName, String  artifactName, IArtifactUsePolicy policy)
#+END_EXAMPLE
**** Removing a policy
Using the operation *removeRolePolicy* of the /WorkspaceArtifact/ where /roleName/ is the role Name, /artifactName/ is the artifact name
#+BEGIN_EXAMPLE
  removeRolePolicy(String roleName, String  artifactName)
#+END_EXAMPLE
**** Setting the default use policy
Using the operation *setDefaultRolePolicy* of the /WorkspaceArtifact/ where /roleName/ is the role name, /artName/ is the artifact name, /policy/ is the policy to add
#+BEGIN_EXAMPLE
  setDefaultRolePolicy(String roleName, String artName, IArtifactUsePolicy policy)
#+END_EXAMPLE
* How can an agent use the organization?
Being part of an organization means for an agent to be able to get the current state of the organization entity and to execute organizational actions on the organization entity. Actions and current state are brought to the agents by /organisational/ artifacts: /GroupBoard/ and /SchemeBoard/
** How can an agent use Groups? 
Agents may use groups by using the GroupBoard Artifact (see the [[http://moise.sf.net/doc/api/ora4mas/nopl/GroupBoard.html][GroupBoard API]])
*** How to manage groups?
**** How to create a group?
An agent can create a group instance by using the *makeArtifact* operation using a /GroupBoard/ artifact template ToBeCompleted
**** How to delete a group?
A group can be deleted by destroying the artifact (~GrId~) that manages it and then disposing the corresponding Artifact.
#+BEGIN_EXAMPLE
  destroy()[artifact_id(GrId)];
  disposeArtifact(GrId);
#+END_EXAMPLE
