lib/jacamo-0.5/doc/faq.html
<li id="sec-2-6-3-2">By discovering an artifact by name<br/>
Using the operation <b>lookupArtifact</b> of the <i>WorkspaceArtifact</i> where <i>artifactName (string)</i> is the name of the artifact, <i>aid</i> is the output parameter receiving the id of the artifact.



<pre class="example">lookupArtifact(String artifactName, OpFeedbackParam&lt;ArtifactId&gt; aid)
</pre>

</li>
</ul>
<ul>
<li id="sec-2-6-3-3">By discovering an artifact by type<br/>
Using the operation <b>lookupArtifactByType</b> of the <i>WorkspaceArtifact</i> where <i>artifactName (string)</i> is the name of the artifact, <i>aid</i> is the output parameter receiving the id of the artifact.



<pre class="example">lookupArtifactByType(String artifactType, OpFeedbackParam&lt;ArtifactId&gt; aid)
</pre>

</li>
</ul>
<ul>
<li id="sec-2-6-3-4">By getting the list of available artifact names<br/>
Using the operation <b>getCurrentArtifacts</b> of the <i>WorkspaceArtifact</i> where <i>list</i> is the output parameter receiving the list of the artifact names.



<pre class="example">getCurrentArtifacts(OpFeedbackParam&lt;String[]&gt; list)
</pre>

</li>
</ul>
<ul>
<li id="sec-2-6-3-5">By getting the current artifact list<br/>
Using the operation <b>getArtifactList</b> of the <i>WorkspaceArtifact</i> where <i>artifacts</i> is the output parameter receiving the list of the artifact ids.



<pre class="example">getArtifactList(OpFeedbackParam&lt;ArtifactId[]&gt; artifacts)
</pre>

</li>
</ul>
</div>

</div>

<div id="outline-container-2-6-4" class="outline-4">
<h4 id="sec-2-6-4"><span class="section-number-4">2.6.4</span> How to observe artifacts?</h4>
<div class="outline-text-4" id="text-2-6-4">

<ul>
<li id="sec-2-6-4-1">Start observing<br/>
Using the operation <b>focus</b> of the <i>WorkspaceArtifact</i> where <i>aid</i> is the artifact id on which ones wants to focus.



<pre class="example">focus(ArtifactId aid)
</pre>

</li>
</ul>
<ul>
<li id="sec-2-6-4-2">Start observing when available<br/>
Using the operation <b>focusWhenAvailable</b> of the <i>WorkspaceArtifact</i> where <i>artName</i> is the artifact name



<pre class="example">focusWhenAvailable(String artName)
</pre>

</li>
</ul>
<ul>
<li id="sec-2-6-4-3">Start observing for specific events<br/>
Using the operation <b>focus</b> of the <i>WorkspaceArtifact</i> where <i>aid</i> is the artifact id, <i>filter</i> is the filter to select which events to perceive



<pre class="example">focus(ArtifactId aid, IEventFilter filter)
</pre>

</li>
</ul>
<ul>
<li id="sec-2-6-4-4">Start observing for specific events when available<br/>
Using the operation <b>focusWhenAvailable</b> of the <i>WorkspaceArtifact</i> where <i>artName</i> is the artifact name, <i>filter</i> is the filter to select the events to perceive



<pre class="example">focusWhenAvailable(String artName, IEventFilter filter)
</pre>

</li>
</ul>
</div>

</div>

<div id="outline-container-2-6-5" class="outline-4">
<h4 id="sec-2-6-5"><span class="section-number-4">2.6.5</span> How to stop Observing artifacts?</h4>
<div class="outline-text-4" id="text-2-6-5">

<ul>
<li id="sec-2-6-5-1">Stop observing an artifact<br/>
Using the operation <b>stopFocus</b> of the <i>WorkspaceArtifact</i> where <i>aid</i> is the artifact id that one wants to stop focusing on



<pre class="example">stopFocus(ArtifactId aid)
</pre>

</li>
</ul>
</div>

</div>

<div id="outline-container-2-6-6" class="outline-4">
<h4 id="sec-2-6-6"><span class="section-number-4">2.6.6</span> How to link artifacts?</h4>
<div class="outline-text-4" id="text-2-6-6">

<p>Using the operation <b>linkArtifacts</b> of the <i>WorkspaceArtifact</i> where <i>artifactOutId</i> is the artifact id source of the link, <i>artifactOutPort</i> is the port of the source, <i>artifactInId</i> is the artifact id of the target of the link
</p>


<pre class="example">linkArtifacts(ArtifactId artifactOutId, String artifactOutPort, ArtifactId artifactInId)
</pre>

</div>

</div>

<div id="outline-container-2-6-7" class="outline-4">
<h4 id="sec-2-6-7"><span class="section-number-4">2.6.7</span> How to add a specific rule-based management to a workspace?</h4>
<div class="outline-text-4" id="text-2-6-7">

<p>Using the operation <b>setWSPRuleEngine</b> of the <i>WorkspaceArtifact</i> where <i>man</i> is the rule engine to add
</p>


<pre class="example">setWSPRuleEngine(AbstractWSPRuleEngine man)
</pre>

</div>

</div>

<div id="outline-container-2-6-8" class="outline-4">
<h4 id="sec-2-6-8"><span class="section-number-4">2.6.8</span> How to add a specific topology to a workspace?</h4>
<div class="outline-text-4" id="text-2-6-8">

<p>Using the operation <b>setWorkspaceTopology</b> of the <i>WorkspaceArtifact</i>
</p>


<pre class="example">setWorkspaceTopology(AbstractWorkspaceTopology topology)
</pre>


</div>

</div>

<div id="outline-container-2-6-9" class="outline-4">
<h4 id="sec-2-6-9"><span class="section-number-4">2.6.9</span> How to add RBAC to a workspace?</h4>
<div class="outline-text-4" id="text-2-6-9">

<ul>
<li id="sec-2-6-9-1">Setting a security manager<br/>
Using the operation <b>setSecurityManager</b> of the <i>WorkspaceArtifact</i> where <i>man</i> is the security manager



<pre class="example">setSecurityManager(IWorkspaceSecurityManager man)
</pre>

</li>
</ul>
<ul>
<li id="sec-2-6-9-2">Adding a role<br/>
Using the operation <b>addRole</b> of the <i>WorkspaceArtifact</i> where <i>roleName</i> is the role Name to add



<pre class="example">addRole(String roleName)
</pre>

</li>
</ul>
<ul>
<li id="sec-2-6-9-3">Removing a role, if it exists<br/>
Using the operation <b>removeRole</b> of the <i>WorkspaceArtifact</i> where <i>roleName</i> is the role Name to remove



<pre class="example">removeRole(String roleName)
</pre>

</li>
</ul>
<ul>
<li id="sec-2-6-9-4">Getting the current roles list<br/>
Using the operation <b>getRoleList</b> of the <i>WorkspaceArtifact</i> where <i>list</i> is the role list



<pre class="example">getRoleList(OpFeedbackParam&lt;String[]&gt; list)
</pre>

</li>
</ul>
<ul>
<li id="sec-2-6-9-5">Adding a policy to a role<br/>
Using the operation <b>addRolePolicy</b> of the <i>WorkspaceArtifact</i> where <i>roleName</i> is the role name, <i>artifactName</i> is the artifact name, <i>policy</i> is the policy



<pre class="example">addRolePolicy(String roleName, String  artifactName, IArtifactUsePolicy policy)
</pre>

</li>
</ul>
<ul>
<li id="sec-2-6-9-6">Removing a policy<br/>
Using the operation <b>removeRolePolicy</b> of the <i>WorkspaceArtifact</i> where <i>roleName</i> is the role Name, <i>artifactName</i> is the artifact name



<pre class="example">removeRolePolicy(String roleName, String  artifactName)
</pre>

</li>
</ul>
<ul>
<li id="sec-2-6-9-7">Setting the default use policy<br/>
Using the operation <b>setDefaultRolePolicy</b> of the <i>WorkspaceArtifact</i> where <i>roleName</i> is the role name, <i>artName</i> is the artifact name, <i>policy</i> is the policy to add



<pre class="example">setDefaultRolePolicy(String roleName, String artName, IArtifactUsePolicy policy)
</pre>

</li>
</ul>
</div>
</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> How can an agent use the organization?</h2>
<div class="outline-text-2" id="text-3">

<p>Being part of an organization means for an agent to be able to get the current state of the organization entity and to execute organizational actions on the organization entity. Actions and current state are brought to the agents by <i>organisational</i> artifacts: <i>GroupBoard</i> and <i>SchemeBoard</i>
</p>
</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> How can an agent use Groups?</h3>
<div class="outline-text-3" id="text-3-1">

<p>Agents may use groups by using the GroupBoard Artifact (see the <a href="http://moise.sf.net/doc/api/ora4mas/nopl/GroupBoard.html">GroupBoard API</a>)
</p>
</div>

<div id="outline-container-3-1-1" class="outline-4">
<h4 id="sec-3-1-1"><span class="section-number-4">3.1.1</span> How to manage groups?</h4>
<div class="outline-text-4" id="text-3-1-1">

<ul>
<li id="sec-3-1-1-1">How to create a group?<br/>
An agent can create a group instance by using the <b>makeArtifact</b> operation using a <i>GroupBoard</i> artifact template ToBeCompleted
</li>
</ul>
<ul>
<li id="sec-3-1-1-2">How to delete a group?<br/>
A group can be deleted by destroying the artifact (<code>GrId</code>) that manages it and then disposing the corresponding Artifact.



<pre class="example">destroy()[artifact_id(GrId)];
disposeArtifact(GrId);
</pre>

</li>
</ul>
<ul>
