lib/jacamo-0.5/doc/faq.org
**** How to get the group specification of a group?
The group specification is accessible through the observable property mapped to  *specification(….)* agent's belief - annotated with artifact(artifact id) (a prolog like representation)
# +BEGIN_EXAMPLE
#+begin_example
  group_specification(group type id, list of role, list of sub-groups, properties) 
#+end_example
# +END_EXAMPLE
Each role in the list is: /role(id,min cardinality, max cardinality, list of compatible roles, list of links)/, each link is: /link(type, target, scopo)/ ([[http://moise.sf.net/doc/api/moise/os/ss/Group.html#getAsProlog()][see explanations]])
*** How to enter a group?
+ for now the only way to enter a group is by adopting a role
*** How to manage roles within a group?
**** How to adopt a role?
An agent can try to adopt /role/ in the group by calling the action *adoptRole* on the GroupBoard in charge of the management of the group
#+BEGIN_EXAMPLE
  adoptRole(String role)
#+END_EXAMPLE
**** How to leave a role?
An agent can try to leave/give up /role/in the group by executing the action *leaveRole* on the GroupBoard in charge of the management of the group
#+BEGIN_EXAMPLE
  leaveRole(String role)
#+END_EXAMPLE
**** How to know what roles are played in a group?
An agent can know the roles that are played in a group by accessing to the observable property mapped to an agent's belief - annotated with the group artifact id - *play* with /agent/ being the agent is playing the /role/ in the /group/
#+BEGIN_EXAMPLE
  play(agent, role, group) 
#+END_EXAMPLE
*** How to manage social scheme responsibilities of a group?
**** How to start a group being responsible of a social scheme?
An agent can start a group being responsible for the scheme /schId/ by using the operation *addScheme* on the GroupBoard in charge on the management of the group
#+BEGIN_EXAMPLE
  addScheme(String schId) 
#+END_EXAMPLE
**** How to stop a group being responsible of a social scheme?
An agent can finish a group being responsible for the scheme /schId/ by using the operation *removeScheme* on the GroupBoard in charge on the management of the group
#+BEGIN_EXAMPLE
  removeScheme(String schId)
#+END_EXAMPLE
**** How to the scheme under the responsibility of a group?
An agent can get the list of schemes ids it is responsible for through the observable property mapped to the agent's belief - annotated with artifact(artifact id) - *schemes*
#+BEGIN_EXAMPLE
  schemes(ListOfSchemes) 
#+END_EXAMPLE
*** How to manage hierachies of groups?
**** How to set the parent of a group?
An agent can set a group becoming a subgroup of /parentGroupId/ by using the operation *setParentGroup*
#+BEGIN_EXAMPLE
  setParentGroup(String parentGroupId) 
#+END_EXAMPLE
**** How to get the hierarchy of a group?
An agent cat get the list of subgroup ids of a group through the observable properties mapped to the agent's beliefs - annotated with artifact(artifact id) - *subgroups*
#+BEGIN_EXAMPLE
  subgroups(ListOfGroupIds)
#+END_EXAMPLE
An agent cat get the parent group id of a group through the observable properties mapped to the agent's beliefs - annotated with artifact(artifact id) - *parentGgroup*
#+BEGIN_EXAMPLE
  parentGroup(GroupId)
#+END_EXAMPLE
*** How to manage ownership of a group?
+ ToBeCompleted
*** How to get the status of a group?
An agent can get the status (i.e. wether the group is well-formed or not) of a group through the observable property mapped to an agent's belief - annotated with the group artifact id - *formationStatus*  (values are /ok/ and /nok/) 
#+BEGIN_EXAMPLE
  formationStatus(OkOrNotOk)
#+END_EXAMPLE
** How can an agent use social schemes?
see the [[http://moise.sf.net/doc/api/ora4mas/nopl/SchemeBoard.html][SchemeBoard API]]
*** How to manage a social scheme?
**** How to create a scheme?
ToBeCompleted
**** How to delete a scheme?
A scheme can be deleted by destroying the artifact (~SchId~) that manages it and then disposing the corresponding Artifact.
#+BEGIN_EXAMPLE
  destroy()[artifact_id(SchId)];
  disposeArtifact(SchId);
#+END_EXAMPLE
**** How to get the scheme specification of a scheme?
The scheme specification is accessible through the observable property mapped to  *specification(….)* agent's belief - annotated with artifact(artifact id) (see [[http://moise.sf.net/doc/api/ora4mas/nopl/SchemeBoard.html][SchemeBoard API]]) ([[http://moise.sf.net/doc/api/moise/os/fs/Scheme.html#getAsProlog()][see explanations]])
#+BEGIN_EXAMPLE
  scheme_specification(id,goals tree starting by root goal,missions)
#+END_EXAMPLE
**** How to know which groups are responsible of a scheme?
An agent can get the list of groups responsible for a scheme through the observable property mapped to the  agent's beliefs - annotated with artifact(artifact id) - *groups*
#+BEGIN_EXAMPLE
  groups(ListOfGroups)
#+END_EXAMPLE
**** How to know that a scheme has been destroyed?
An agent can get the fact that an artifact has been destroyed through the belief *destroyed*
#+BEGIN_EXAMPLE
  destroyed(artifact id)
#+END_EXAMPLE
*** How to manage goals?
**** How to set a goal of a social scheme as achieved?
An agent can set a goal as achieved using the action *goalAchieved*
#+BEGIN_EXAMPLE
goalAchieved(String goal) 
#+END_EXAMPLE
Note: verifications that the agent is committed to the goal and that the goal has been enabled throwing a /normFailure/ in the case of breaking some regimentation
**** How to set an argument to a goal?
An agent can set a /value/ for the /goal/ argument /var/ by using the action *setArgumentValue*
#+BEGIN_EXAMPLE
setArgumentValue(String goal, String var, Object value) 
#+END_EXAMPLE
**** How to reset a goal and relaunch its achievement?
An agent can reset the status of a goal by using the action *resetGoal*
#+BEGIN_EXAMPLE
resetGoal(String goal)
#+END_EXAMPLE
**** How to get a goal state?
The status of a goal is accessible through the observable property mapped to the agent's belief - annotated with artifact(artifact id) - *goalState* 
#+BEGIN_EXAMPLE
  goalState(schId, goalId, list of committed agents, list of agents that achieved the goal, state) 
#+END_EXAMPLE
The /state/ refers to the goal status: /waiting/, /enabled/, /satisfied/). 
*** How to manage missions?
**** How to commit to a mission? 
An agent can try to commit to a mission in the scheme by using the action *commitMission*
#+BEGIN_EXAMPLE
commitMission(String mission)
#+END_EXAMPLE
/Note/: verifications of the mission max cardinality and mission permissions, throwing /normFailure/ in the case of breaking some regimentation)
