lib/jacamo-0.5/doc/faq.html
<li id="sec-3-1-1-3">How to get the group specification of a group?<br/>
The group specification is accessible through the observable property mapped to  <b>specification(….)</b> agent's belief - annotated with artifact(artifact id) (a prolog like representation)



<pre class="example">group_specification(group type id, list of role, list of sub-groups, properties) 
</pre>

<p>
Each role in the list is: <i>role(id,min cardinality, max cardinality, list of compatible roles, list of links)</i>, each link is: <i>link(type, target, scopo)</i> (<a href="http://moise.sf.net/doc/api/moise/os/ss/Group.html#getAsProlog()">see explanations</a>)
</p></li>
</ul>
</div>

</div>

<div id="outline-container-3-1-2" class="outline-4">
<h4 id="sec-3-1-2"><span class="section-number-4">3.1.2</span> How to enter a group?</h4>
<div class="outline-text-4" id="text-3-1-2">

<ul>
<li>for now the only way to enter a group is by adopting a role
</li>
</ul>

</div>

</div>

<div id="outline-container-3-1-3" class="outline-4">
<h4 id="sec-3-1-3"><span class="section-number-4">3.1.3</span> How to manage roles within a group?</h4>
<div class="outline-text-4" id="text-3-1-3">

<ul>
<li id="sec-3-1-3-1">How to adopt a role?<br/>
An agent can try to adopt <i>role</i> in the group by calling the action <b>adoptRole</b> on the GroupBoard in charge of the management of the group



<pre class="example">adoptRole(String role)
</pre>

</li>
</ul>
<ul>
<li id="sec-3-1-3-2">How to leave a role?<br/>
An agent can try to leave/give up /role/in the group by executing the action <b>leaveRole</b> on the GroupBoard in charge of the management of the group



<pre class="example">leaveRole(String role)
</pre>

</li>
</ul>
<ul>
<li id="sec-3-1-3-3">How to know what roles are played in a group?<br/>
An agent can know the roles that are played in a group by accessing to the observable property mapped to an agent's belief - annotated with the group artifact id - <b>play</b> with <i>agent</i> being the agent is playing the <i>role</i> in the <i>group</i>



<pre class="example">play(agent, role, group) 
</pre>

</li>
</ul>
</div>

</div>

<div id="outline-container-3-1-4" class="outline-4">
<h4 id="sec-3-1-4"><span class="section-number-4">3.1.4</span> How to manage social scheme responsibilities of a group?</h4>
<div class="outline-text-4" id="text-3-1-4">

<ul>
<li id="sec-3-1-4-1">How to start a group being responsible of a social scheme?<br/>
An agent can start a group being responsible for the scheme <i>schId</i> by using the operation <b>addScheme</b> on the GroupBoard in charge on the management of the group



<pre class="example">addScheme(String schId) 
</pre>

</li>
</ul>
<ul>
<li id="sec-3-1-4-2">How to stop a group being responsible of a social scheme?<br/>
An agent can finish a group being responsible for the scheme <i>schId</i> by using the operation <b>removeScheme</b> on the GroupBoard in charge on the management of the group



<pre class="example">removeScheme(String schId)
</pre>

</li>
</ul>
<ul>
<li id="sec-3-1-4-3">How to the scheme under the responsibility of a group?<br/>
An agent can get the list of schemes ids it is responsible for through the observable property mapped to the agent's belief - annotated with artifact(artifact id) - <b>schemes</b>



<pre class="example">schemes(ListOfSchemes) 
</pre>

</li>
</ul>
</div>

</div>

<div id="outline-container-3-1-5" class="outline-4">
<h4 id="sec-3-1-5"><span class="section-number-4">3.1.5</span> How to manage hierachies of groups?</h4>
<div class="outline-text-4" id="text-3-1-5">

<ul>
<li id="sec-3-1-5-1">How to set the parent of a group?<br/>
An agent can set a group becoming a subgroup of <i>parentGroupId</i> by using the operation <b>setParentGroup</b>



<pre class="example">setParentGroup(String parentGroupId) 
</pre>

</li>
</ul>
<ul>
<li id="sec-3-1-5-2">How to get the hierarchy of a group?<br/>
An agent cat get the list of subgroup ids of a group through the observable properties mapped to the agent's beliefs - annotated with artifact(artifact id) - <b>subgroups</b>



<pre class="example">subgroups(ListOfGroupIds)
</pre>

<p>
An agent cat get the parent group id of a group through the observable properties mapped to the agent's beliefs - annotated with artifact(artifact id) - <b>parentGgroup</b>
</p>


<pre class="example">parentGroup(GroupId)
</pre>

</li>
</ul>
</div>

</div>

<div id="outline-container-3-1-6" class="outline-4">
<h4 id="sec-3-1-6"><span class="section-number-4">3.1.6</span> How to manage ownership of a group?</h4>
<div class="outline-text-4" id="text-3-1-6">

<ul>
<li>ToBeCompleted
</li>
</ul>

</div>

</div>

<div id="outline-container-3-1-7" class="outline-4">
<h4 id="sec-3-1-7"><span class="section-number-4">3.1.7</span> How to get the status of a group?</h4>
<div class="outline-text-4" id="text-3-1-7">

<p>An agent can get the status (i.e. wether the group is well-formed or not) of a group through the observable property mapped to an agent's belief - annotated with the group artifact id - <b>formationStatus</b>  (values are <i>ok</i> and <i>nok</i>) 
</p>


<pre class="example">formationStatus(OkOrNotOk)
</pre>

</div>
</div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> How can an agent use social schemes?</h3>
<div class="outline-text-3" id="text-3-2">

<p>see the <a href="http://moise.sf.net/doc/api/ora4mas/nopl/SchemeBoard.html">SchemeBoard API</a>
</p>
</div>

<div id="outline-container-3-2-1" class="outline-4">
<h4 id="sec-3-2-1"><span class="section-number-4">3.2.1</span> How to manage a social scheme?</h4>
<div class="outline-text-4" id="text-3-2-1">

<ul>
<li id="sec-3-2-1-1">How to create a scheme?<br/>
ToBeCompleted
</li>
</ul>
<ul>
<li id="sec-3-2-1-2">How to delete a scheme?<br/>
A scheme can be deleted by destroying the artifact (<code>SchId</code>) that manages it and then disposing the corresponding Artifact.



<pre class="example">destroy()[artifact_id(SchId)];
disposeArtifact(SchId);
</pre>

</li>
</ul>
<ul>
<li id="sec-3-2-1-3">How to get the scheme specification of a scheme?<br/>
The scheme specification is accessible through the observable property mapped to  <b>specification(….)</b> agent's belief - annotated with artifact(artifact id) (see <a href="http://moise.sf.net/doc/api/ora4mas/nopl/SchemeBoard.html">SchemeBoard API</a>) (<a href="http://moise.sf.net/doc/api/moise/os/fs/Scheme.html#getAsProlog()">see explanations</a>)



<pre class="example">scheme_specification(id,goals tree starting by root goal,missions)
</pre>

</li>
</ul>
<ul>
<li id="sec-3-2-1-4">How to know which groups are responsible of a scheme?<br/>
An agent can get the list of groups responsible for a scheme through the observable property mapped to the  agent's beliefs - annotated with artifact(artifact id) - <b>groups</b>



<pre class="example">groups(ListOfGroups)
</pre>

</li>
</ul>
<ul>
<li id="sec-3-2-1-5">How to know that a scheme has been destroyed?<br/>
An agent can get the fact that an artifact has been destroyed through the belief <b>destroyed</b>



<pre class="example">destroyed(artifact id)
</pre>

</li>
</ul>
</div>

</div>

<div id="outline-container-3-2-2" class="outline-4">
<h4 id="sec-3-2-2"><span class="section-number-4">3.2.2</span> How to manage goals?</h4>
<div class="outline-text-4" id="text-3-2-2">

<ul>
<li id="sec-3-2-2-1">How to set a goal of a social scheme as achieved?<br/>
An agent can set a goal as achieved using the action <b>goalAchieved</b>



<pre class="example">goalAchieved(String goal) 
</pre>

<p>
Note: verifications that the agent is committed to the goal and that the goal has been enabled throwing a <i>normFailure</i> in the case of breaking some regimentation
</p></li>
</ul>
<ul>
<li id="sec-3-2-2-2">How to set an argument to a goal?<br/>
An agent can set a <i>value</i> for the <i>goal</i> argument <i>var</i> by using the action <b>setArgumentValue</b>



<pre class="example">setArgumentValue(String goal, String var, Object value) 
</pre>

</li>
</ul>
<ul>
<li id="sec-3-2-2-3">How to reset a goal and relaunch its achievement?<br/>
An agent can reset the status of a goal by using the action <b>resetGoal</b>



<pre class="example">resetGoal(String goal)
</pre>

</li>
</ul>
<ul>
<li id="sec-3-2-2-4">How to get a goal state?<br/>
The status of a goal is accessible through the observable property mapped to the agent's belief - annotated with artifact(artifact id) - <b>goalState</b> 



<pre class="example">goalState(schId, goalId, list of committed agents, list of agents that achieved the goal, state) 
</pre>

<p>
The <i>state</i> refers to the goal status: <i>waiting</i>, <i>enabled</i>, <i>satisfied</i>). 
</p></li>
</ul>
</div>

</div>

<div id="outline-container-3-2-3" class="outline-4">
<h4 id="sec-3-2-3"><span class="section-number-4">3.2.3</span> How to manage missions?</h4>
<div class="outline-text-4" id="text-3-2-3">

<ul>
<li id="sec-3-2-3-1">How to commit to a mission?<br/>
An agent can try to commit to a mission in the scheme by using the action <b>commitMission</b>



<pre class="example">commitMission(String mission)
</pre>

<p>
<i>Note</i>: verifications of the mission max cardinality and mission permissions, throwing <i>normFailure</i> in the case of breaking some regimentation)
</p></li>
</ul>
<ul>
