lib/jacamo-0.5/doc/faq.org
**** How to leave a mission? 
An agent can leave its misseion in the scheme by using the action *leaveMission*
#+BEGIN_EXAMPLE
  leaveMission(String mission) 
#+END_EXAMPLE
/Note/: verification that the agent is committed to the mission and that the mission's goals have been satisfied throwing a /normFailure/ in the case of breaking some regimentation
**** How to get the current mission commitments?
The current mission commitments are accessible through the observable property mapped to an agent's belief - annotated with artifact(artifact id) - *commitment* telling that agent ag is committed to the mission in the scheme (we have as many obs prop as commitments) 
#+BEGIN_EXAMPLE
  commitment(agent, mission, scheme) 
#+END_EXAMPLE
** How can an agent manage norms and obligations?
*** How to get the current obligations?
An agent can get current active obligation through the observable property mapped to an agent's belief - annotated with artifact(artifact id) - *obligation*: 
#+BEGIN_EXAMPLE
  obligation(agent,norm,goal,deadline) 
#+END_EXAMPLE
*** How to get the status of a norm? 
An agent can get the status of a norm thanks to organizational events mapped to the following agent's beliefs: *oblCreated* (the obligation /o/ is created), *oblFulfilled* (the obligation /o/ is fulfilled), *oblUnfulfilled* (the obligation /o/ is unfulfilled (e.g. by timeout), *oblInactive* (the obligation /o/ is inactive (e.g. its condition does not hold anymore))
#+BEGIN_EXAMPLE
oblCreated(o)
oblFulfilled(o)
oblUnfulfilled(o)
oblInactive(o) 
#+END_EXAMPLE
*** How to get the reason why a norm has failed?
An agent can get the failure reason /f/ (e.g. due to some regimentation violation) of a norm thanks thanks to organizational events mapped to agent's belief *normFailure*:
#+BEGIN_EXAMPLE
normFailure(f) 
#+END_EXAMPLE
* COMMENT How to use the .jcm file?
** Template
*** example global 
#+BEGIN_EXAMPLE
mas olivier { .... }
#+END_EXAMPLE
*** Agent definition
**** definition
#+BEGIN_EXAMPLE
<agent>     ::= agent <name> [ : <source> ] { <parameter>* }
<parameter> ::= <id> : <value> ( (, | EOL) <value> ) *
<id>        ::= beliefs | goals | ag-class | ag-arch | ag-bb-class |
                verbose | myparameter | node | instances | join | focus |
                roles
#+END_EXAMPLE
**** example
#+BEGIN_EXAMPLE
      agent bob : participant.asl {                    // if source is omitted, bob.asl will be used
           // initial beliefs
           beliefs:     p("this is a condition",15000)   
                        friend(alice)
           // initial goals
           goals:       start, go(home)                  
           // if omitted, Jason Agent default class will be used
           ag-class:    tt.MyAgClass                     
           // CArtAgO arch is automatically included, if necessary, JADE arch is automatically included
           ag-arch:     myp.myArch1
                        mypkg.MyCustomAgArch             
           ag-bb-class: my.Bb
           // 0 means only agent output, 1 means agent+jason output, 2 means agent+jason+debug output
           verbose:     2                                
           // user application parameter, used for instance by user custom architectures
           myparameter: "this is an appl paramter"       
           // the logical name of the place where the agent will run
           node:        n1                               
           // 5 bobs (called bob1, bob2, ... bob5) will be created. 
           // You can also list the names of the agents. Default value is 1.
           instances:   5                                
           // join the workspace w2
           join:        w2                               
           // focus on artifact a1 in workspace w1 running on node n1
           focus:       w1.a1 @ n1                       
           // adopt the role r1 in group g2 and role r2 in group g3 (in org o1)
           roles:       r1 in g2, r2 in o1.g3            
      }
      // the source is alice.asl, one instance will be created at default node
      agent alice
#+END_EXAMPLE
*** Environment definition
**** Definition
#+BEGIN_EXAMPLE
       <environment> ::= <workspace>*
       <workspace>   ::= workspace <name> { <artifact>* <agents> <node> }
       <artifact>    ::= artifact  <name> : <type> [ { focused-by: <agents> } ]
       <agents>      ::= agents : <name> ( (, | EOL) <name> )* | "*"   // "*" means all agents
       <node>        ::= node :   <name> EOL
#+END_EXAMPLE
**** Example
#+BEGIN_EXAMPLE
       workspace w1 {
          // creates an artifact named c1 as an instance of mylib.Counter 
          // initialised with (10) 
          artifact c1: mylib.Counter(10)               
          artifact bll: mylist.BlackList() 
          // this workspace will run on node n2
          node: n2                                     
       }
#+END_EXAMPLE
*** Organisation Entity definition
**** Definition
#+BEGIN_EXAMPLE
       <organisations> ::= <org>*
       <org>           ::= organisation <name> [ : <source> ] { <parameter>* <agents> <node> <group>* <scheme>* }
       <group>         ::= group  <name> : <type> [ { <parameter>* } ] 
       <scheme>        ::= scheme <name> : <type> [ { <parameter>* } ] 
#+END_EXAMPLE
**** Example
#+BEGIN_EXAMPLE
      // os.xml is the file with the organisational specification, 
      // if omitted o1.xml is used
      organisation o1 : os.xml {                      
           // creates a group instance named g1 based on the group definition 
           // identified by writepaper (defined in the o1.xml file)
           group g1: writepaper {                       
           responsible-for: s1                       
           // the group will be responsible for the scheme s1
           owner: alice
           // starts GUI for this group             
           debug                                     
           // groups sg2 will be a sub-group of g1          
           group sg2 : t1                            
        }             
        // another group (without particular initialisation) 
        group g2 : writepaper                        
        
        // instance of scheme identified by wpscheme (in o1.xml)  
        scheme s1 : wpscheme                         
     }
     asl-path: src/agt
               src/agt/inc
#+END_EXAMPLE
*** Platform configuration
**** example
#+BEGIN_EXAMPLE
         platform: jade() 
                cartago("infrastructure")
#+END_EXAMPLE
*** Node configuration
**** example
#+BEGIN_EXAMPLE
       node n3 running @ x.com.fr
       // nodes not defined will be launched when this .jcm is run
#+END_EXAMPLE
** Configuration
+ use the common-cartago.asl from jacamo (acquired automatically by creating an agent by using the plugin)
** Multi-Agent System Basic Components
*** Agents
Three kinds of skill are considered: 
+ skills to use Jason internal actions: [[./src/agt/inc/default-acting-skills.asl][default-acting-skills.asl]]
+ skills to act using only one artifact: [[./src/agt/inc/acting-skills.asl][acting-skills.asl]]
+ skills to act using all the artifacts able to enact the involved action: [[./src/agt/inc/acting-on-all-artifacts-skills.asl][acting-on-all-artifacts-skills.asl]]
Besides these skills related to acting on the environment, agents may have organizational reasoning skills
+ skills to reason on the organization: 
  + [[./src/agt/inc/org-obedient.asl][org-obedient.asl]]: obedience to the organization to which they participate.
  + [[./src/agt/inc/org-reasoning.asl][org-reasoning.asl]]: reasoning on the organization to adapt/change/manage it.
**** Obedient agents able to act using one artifact
+ [[./acting-agent.asl][acting-agent.asl]]
**** Obedient agents able to act using all artifacts
+ [[./acting-on-all-artifacts-agent.asl][acting-on-all-artifacts-agent.asl]]
**** Obedient agents able to act using all artifacts and reasoning on the organization
+ [[./acting-on-all-artifacts-org-reasonner-agent.asl][acting-on-all-artifacts-org-reasonner-agent.asl]]
*** Environment/ Workspace/ Artifact
A GUI Artifact displaying the message produced by the agent
+ [[./src/env/display/GUIConsole.java][GUIConsole.java]] and its accompanying display: [[./src/env/display/Display.java][Display.java]]
*** Organization
+ One structure with a simple plan: [[./src/org/simple-os.xml][simple-os.xml]]
+ One structure with a plan allocating one goal per role: [[./src/org/only-one-goalduty-os.xml][only-one-goalduty-os.xml]]
+ One structure with a plan intermixing goal execution (with same goals): [[./src/org/intermixing-goal-duties-os.xml][intermixing-goal-duties-os.xml]]
+ One structure with a plan intermixing goal execution (with different goals): [[./src/org/intermixing-different-goal-duties-os.xml][intermixing-different-goal-duties-os.xml]]
** Basic Hello MAS
*** Simple launching configuration
+ Set of [[./src/agt/acting-on-default-artifacts-agent.asl][acting-on-default-artifacts-agent.asl]] agents
+ Use of default /Console/ Artifact
+ Simple [[./src/org/simple-os.xml][simple-os.xml]] organization
**** Basic launch
+ [[./helloJaCaMo-1a-basic.jcm][helloJaCaMo-1a-basic.jcm]]
**** Variation on goal allocations
+ [[./helloJaCaMo-1b-basic-playing-with-goal.jcm][helloJaCaMo-1b-basic-playing-with-goal.jcm]]
**** Use of a richer organization 
+ Set of [[./src/agt/acting-on-default-artifacts-agent.asl][acting-on-default-artifacts-agent.asl]] agents
+ Use of default /Console/ Artifact
+ Simple [[./src/org/only-one-goalduty-os.xml][only-one-goalduty-os.xml]] organization
***** Basic launch
+ [[./helloJaCaMo-2a-basic-only_one_goalduty_os.jcm][helloJaCaMo-2a-basic-only_one_goalduty_os.jcm]]
***** Variation on goal allocations
+ [[./helloJaCaMo-2b-basic-only_one_goalduty_os-playing-with-goals.jcm][helloJaCaMo-2b-basic-only_one_goalduty_os-playing-with-goals.jcm]]
*** Use of dedicated Artifacts
**** Simple organization, internal goals
+ Agents declare joining workspace: [[./helloJaCaMo-3a-workspace-jacamo.jcm][helloJaCaMo-3a-workspace-jacamo.jcm]]
+ Workspace declare agents joining: [[./helloJaCaMo-3b-workspace-jacamo.jcm][helloJaCaMo-3b-workspace-jacamo.jcm]]
**** Richer organization
+ [[./helloJaCaMo-3a-workspace-jacamo-only_one_goalduty_os.jcm][helloJaCaMo-3a-workspace-jacamo-only_one_goalduty_os.jcm]]
** Hello MAS using multiple workspaces
*** On the same machine
**** Test of the join workspace effects, agent uses artifact in its workspace
+ With simple organization: [[./helloJaCaMo-4a-multiple-workspaces-join-effects.jcm][helloJaCaMo-4a-multiple-workspaces-join-effects.jcm]]
+ With richer organization: [[./helloJaCaMo-4a-multiple-workspaces-only_one_goalduty_os-join-effects.jcm][helloJaCaMo-4a-multiple-workspaces-only_one_goalduty_os-join-effects.jcm]]
**** Test of the join workspace effects, some agents use all artifacts of their workspaces 
+ With richer organization, use of beliefs with the name of the artifacts: [[./helloJaCaMo-4a-multiple-workspaces-only_one_goalduty_os-acting_on_all_artifacts_agent-artifact_belief.jcm][helloJaCaMo-4a-multiple-workspaces-only_one_goalduty_os-acting_on_all_artifacts_agent-artifact_belief.jcm]]
+ With richer organization, test of the join effects: [[./helloJaCaMo-4a-multiple-workspaces-only_one_goalduty_os-acting_on_all_artifacts_agent-join-effects.jcm][helloJaCaMo-4a-multiple-workspaces-only_one_goalduty_os-acting_on_all_artifacts_agent-join-effects.jcm]]
**** 
+ [[./helloJaCaMo-4b-multiple-workspaces-side-effect-focus.jcm][helloJaCaMo-4b-multiple-workspaces-side-effect-focus.jcm]]
** Hello MAS using multiple workspaces in a distributed setting
In this part, only one organization either simple or rich, 4 workspaces on three nodes.
It should be used with a combination of one configuration for America, Europe and Mirrorworld.
*** With only one organization in the infrastructure node
**** America Node
+ Using one artifact: [[./helloJaCaMo-5a-dist-america-without-org.jcm][helloJaCaMo-5a-dist-america-without-org.jcm]]
+ Using all artifacts: [[./helloJaCaMo-5a-dist-america-without-org-acting_on_all_artifacts_agent.jcm][helloJaCaMo-5a-dist-america-without-org-acting_on_all_artifacts_agent.jcm]]
**** Europe Node
+ Using one artifact: [[./helloJaCaMo-5a-dist-europe-without-org.jcm][helloJaCaMo-5a-dist-europe-without-org.jcm]]
**** Mirrorworld Node
+ Simple Organization: [[./helloJaCaMo-5a-dist-mirrorworld-simple_os.jcm][helloJaCaMo-5a-dist-mirrorworld-simple_os.jcm]]
+ Richer Organization: [[./helloJaCaMo-5a-dist-mirrorworld-only_one_goalduty_os.jcm][helloJaCaMo-5a-dist-mirrorworld-only_one_goalduty_os.jcm]]
*** With only one organization in one non-infrastructure node
**** America Node
+ [[./helloJaCaMo-5b-dist-america.jcm][helloJaCaMo-5b-dist-america.jcm]]
**** Europe Node
+ [[./helloJaCaMo-5b-dist-europe-with-org.jcm][helloJaCaMo-5b-dist-europe-with-org.jcm]]
