lib/jacamo-0.5/doc/faq.html
<li id="sec-3-2-3-2">How to leave a mission?<br/>
An agent can leave its misseion in the scheme by using the action <b>leaveMission</b>



<pre class="example">leaveMission(String mission) 
</pre>

<p>
<i>Note</i>: verification that the agent is committed to the mission and that the mission's goals have been satisfied throwing a <i>normFailure</i> in the case of breaking some regimentation
</p></li>
</ul>
<ul>
<li id="sec-3-2-3-3">How to get the current mission commitments?<br/>
The current mission commitments are accessible through the observable property mapped to an agent's belief - annotated with artifact(artifact id) - <b>commitment</b> telling that agent ag is committed to the mission in the scheme (we have as many obs prop as commitments) 



<pre class="example">commitment(agent, mission, scheme) 
</pre>

</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> How can an agent manage norms and obligations?</h3>
<div class="outline-text-3" id="text-3-3">


</div>

<div id="outline-container-3-3-1" class="outline-4">
<h4 id="sec-3-3-1"><span class="section-number-4">3.3.1</span> How to get the current obligations?</h4>
<div class="outline-text-4" id="text-3-3-1">

<p>An agent can get current active obligation through the observable property mapped to an agent's belief - annotated with artifact(artifact id) - <b>obligation</b>: 
</p>


<pre class="example">obligation(agent,norm,goal,deadline) 
</pre>

</div>

</div>

<div id="outline-container-3-3-2" class="outline-4">
<h4 id="sec-3-3-2"><span class="section-number-4">3.3.2</span> How to get the status of a norm?</h4>
<div class="outline-text-4" id="text-3-3-2">

<p>An agent can get the status of a norm thanks to organizational events mapped to the following agent's beliefs: <b>oblCreated</b> (the obligation <i>o</i> is created), <b>oblFulfilled</b> (the obligation <i>o</i> is fulfilled), <b>oblUnfulfilled</b> (the obligation <i>o</i> is unfulfilled (e.g. by timeout), <b>oblInactive</b> (the obligation <i>o</i> is inactive (e.g. its condition does not hold anymore))
</p>


<pre class="example">oblCreated(o)
oblFulfilled(o)
oblUnfulfilled(o)
oblInactive(o) 
</pre>

</div>

</div>

<div id="outline-container-3-3-3" class="outline-4">
<h4 id="sec-3-3-3"><span class="section-number-4">3.3.3</span> How to get the reason why a norm has failed?</h4>
<div class="outline-text-4" id="text-3-3-3">

<p>An agent can get the failure reason <i>f</i> (e.g. due to some regimentation violation) of a norm thanks thanks to organizational events mapped to agent's belief <b>normFailure</b>:
</p>


<pre class="example">normFailure(f) 
</pre>



</div>
</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: September 2015</p>
<p class="author">Author: JaCaMo Team</p>
<p class="email"><a href="mailto:"></a></p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.3f with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
